In [4]:
import numpy as np
import pandas as pd

In [5]:
a1=np.linspace(10,15,5,dtype="int")
a2=np.linspace(15,20,5,dtype="int")
a3=np.linspace(20,25,5,dtype="int")
df=pd.DataFrame([a1,a2,a3])
df

    0   1   2   3   4
0  10  11  12  13  15
1  15  16  17  18  20
2  20  21  22  23  25

In [6]:
sözlük={"var1":a1,"var2":a2,"var3":a3}
df2=pd.DataFrame(sözlük)
df2

   var1  var2  var3
0    10    15    20
1    11    16    21
2    12    17    22
3    13    18    23
4    15    20    25

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
type(df2)

pandas.core.frame.DataFrame

In [29]:
df[0:2]

    0   1   2   3   4
0  10  11  12  13  15
1  15  16  17  18  20

In [30]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
df2.index=["a","b","c","d","e"]

In [18]:
df2

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

In [19]:
df2["a":"d"]

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23

In [21]:
df2["var3"]

b    21
c    22
d    23
e    25
Name: var3, dtype: int64

## silme

In [12]:
df2.drop("a",axis=0)

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

In [13]:
df2 #kalıcı olması için inplace aktif olmalı

   var1  var2  var3
a    10    15    20
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

In [14]:
df2.drop("a",axis=0,inplace=True)
df2

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

In [15]:
df2

   var1  var2  var3
b    11    16    21
c    12    17    22
d    13    18    23
e    15    20    25

fancy index ile silme

In [22]:
delete=["c","e"]
df2.drop(delete,axis=0)

   var1  var2  var3
b    11    16    21
d    13    18    23

### sorgulama in

In [23]:
l=["var1","var2","var"]
for i in l:
    print(i in df2)

True
True
False

In [24]:
df

    0   1   2   3   4
0  10  11  12  13  15
1  15  16  17  18  20
2  20  21  22  23  25

In [25]:
delet=[1,2,3]
df.drop(delet,axis=1)

    0   4
0  10  15
1  15  20
2  20  25